InformationRegisters/LN_МСРАудитВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>LN_МСРАудитВызовов</Name>
			<Comment>Журнал каждого вызова MCP tool: имя, параметры, результат, длительность, ошибка</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВызова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>ИмяИнструмента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Успех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерОтветаБайт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/LN_МСРАудит/Ext/Module.bsl
//LN++ Общий модуль LN_МСРАудит
// Логирует каждый вызов MCP-tool в РегистрСведений.LN_МСРАудитВызовов
// и при ошибках/предупреждениях — в журнал регистрации (категория MCP.tool.<имя>).
//
//   НачалоЗамера(ИмяИнструмента, Аргументы, АдресКлиента = "") -> Структура (контекст замера)
//   ЗавершитьЗамерУспех(Контекст, РазмерОтветаБайт)
//   ЗавершитьЗамерОшибка(Контекст, ТекстОшибки)
//

#Область ПрограммныйИнтерфейс

Функция НачалоЗамера(ИмяИнструмента, Аргументы, АдресКлиента = "") Экспорт

	Контекст = Новый Структура;
	Контекст.Вставить("Идентификатор", Строка(Новый УникальныйИдентификатор));
	Контекст.Вставить("ИмяИнструмента", ИмяИнструмента);
	Контекст.Вставить("Аргументы", LN_МСРКодирование.ОбрезатьСтроку(LN_МСРКодирование.ЗначениеВJSON(Аргументы, Истина), 2000));
	Контекст.Вставить("АдресКлиента", АдресКлиента);
	Контекст.Вставить("Начало", ТекущаяУниверсальнаяДатаВМиллисекундах());
	Возврат Контекст;

КонецФункции

Процедура ЗавершитьЗамерУспех(Контекст, РазмерОтветаБайт = 0) Экспорт

	ЗаписатьИтог(Контекст, Истина, "", РазмерОтветаБайт);

КонецПроцедуры

Процедура ЗавершитьЗамерОшибка(Контекст, ТекстОшибки) Экспорт

	ЗаписатьИтог(Контекст, Ложь, ТекстОшибки, 0);

	// дополнительно в журнал регистрации
	ЗаписьЖурналаРегистрации(
		"MCP.tool." + Контекст.ИмяИнструмента + ".Ошибка",
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстОшибки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьИтог(Контекст, Успех, ТекстОшибки, РазмерОтветаБайт)

	Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - Контекст.Начало;

	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.LN_МСРАудитВызовов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторВызова.Установить(Контекст.Идентификатор);
	Запись = НаборЗаписей.Добавить();
	Запись.Период              = ТекущаяДатаСеанса();
	Запись.ИдентификаторВызова = Контекст.Идентификатор;
	Запись.ИмяИнструмента      = Контекст.ИмяИнструмента;
	Запись.Параметры           = Контекст.Аргументы;
	Запись.Длительность        = Длительность;
	Запись.Успех               = Успех;
	Запись.ТекстОшибки         = LN_МСРКодирование.ОбрезатьСтроку(ТекстОшибки, 1024);
	Запись.АдресКлиента        = Контекст.АдресКлиента;
	Запись.РазмерОтветаБайт    = РазмерОтветаБайт;
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти
//LN--
